package ru.enchilik.gallows;

import java.util.Set;

public class Consts {
    public static final Set<Character> validCharacters = Set.of(
            'а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п',
            'р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я'
    );

    public static final String[] dictionary = {
            "Молоко",
            "Бутерброд",
            "Сгущёнка",
            "Сырбездыр",
            "Варенье",
            "Чипсы",
            "Печеньки",
            "Колбаса",
            "Микроволновка",
            "Перекус"
    };

    public static final String[] gallows =
            {
                            "     |------\n" +
                            "     |     |\n" +
                            "     |     \n" +
                            "     |    \n" +
                            "     |    \n" +
                            "    / \\",

                            "     |------\n" +
                            "     |     |\n" +
                            "     |     O\n" +
                            "     |    \n" +
                            "     |    \n" +
                            "    / \\",

                            "     |------\n" +
                            "     |     |\n" +
                            "     |     O\n" +
                            "     |    /\n" +
                            "     |    \n" +
                            "    / \\",

                            "     |------\n" +
                            "     |     |\n" +
                            "     |     O\n" +
                            "     |    /|\n" +
                            "     |    \n" +
                            "    / \\",
                            "     |------\n" +
                            "     |     |\n" +
                            "     |     O\n" +
                            "     |    /|\\\n" +
                            "     |    \n" +
                            "    / \\",

                            "     |------\n" +
                            "     |     |\n" +
                            "     |     O\n" +
                            "     |    /|\\\n" +
                            "     |    / \n" +
                            "    / \\",

                            "     |------\n" +
                            "     |     |\n" +
                            "     |     O\n" +
                            "     |    /|\\\n" +
                            "     |    / \\\n" +
                            "    / \\"
            };
}
